Revit 2026 API
DWGImportOptions Methods
The DWGImportOptions type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from BaseImportOptions)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetDefaultLengthUnit |  Get the default length unit used for importing unitless files.
(Inherited from BaseImportOptions)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetLayerSelection |  Get all set layers name which user want to import into Revit.
(Inherited from BaseImportOptions)
GetLineWeights |  Gets array of line weights.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetDefaultLengthUnit |  Set the default length unit used for importing unitless files.
(Inherited from BaseImportOptions)
SetLayerSelection
(Inherited from BaseImportOptions)
SetLineWeights
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
DWGImportOptions Class
Autodesk.Revit.DB Namespace